#include <stdio.h>
#include <math.h>

int main() {
   float a, b, c, s, area;
   printf("Введіть довжини сторін трикутника: "); 
    //вводимо довжини сторін трикутника
   scanf("%f %f %f", &a, &b, &c);

   // Oбчислюємо його периметр 's'
   s = (a + b + c) / 2;

   // Використовуємо цей периметр для обчислення площі трикутника за формулою Герона
   area = sqrt(s * (s - a) * (s - b) * (s - c));
  //Виводимо площу трикутника заокруглену до двох знаків після коми

   printf("Площа трикутника зі сторонами %.2f, %.2f та %.2f дорівнює %.2f", a, b, c, area);

   return 0;
}
